<a href="https://colab.research.google.com/github/ScMofeoluwa/Competitions/blob/master/Day7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('AirQualityUCI.csv',sep=';',decimal=',')

In [ ]:
df.head()

         Date      Time  CO(GT)  ...      AH  Unnamed: 15  Unnamed: 16
0  10/03/2004  18.00.00     2.6  ...  0.7578          NaN          NaN
1  10/03/2004  19.00.00     2.0  ...  0.7255          NaN          NaN
2  10/03/2004  20.00.00     2.2  ...  0.7502          NaN          NaN
3  10/03/2004  21.00.00     2.2  ...  0.7867          NaN          NaN
4  10/03/2004  22.00.00     1.6  ...  0.7888          NaN          NaN

[5 rows x 17 columns]

In [ ]:
df.drop(['Unnamed: 15','Unnamed: 16'],axis=1,inplace=True)

In [ ]:
df.isnull().sum()

Date             114
Time             114
CO(GT)           114
PT08.S1(CO)      114
NMHC(GT)         114
C6H6(GT)         114
PT08.S2(NMHC)    114
NOx(GT)          114
PT08.S3(NOx)     114
NO2(GT)          114
PT08.S4(NO2)     114
PT08.S5(O3)      114
T                114
RH               114
AH               114
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9471 entries, 0 to 9470
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   object
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   float64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: float64(13), object(2)
memory usage: 1.1+ MB

In [ ]:
df['Date'].value_counts()

04/12/2004    24
17/07/2004    24
01/09/2004    24
01/06/2004    24
05/02/2005    24
              ..
26/01/2005    24
15/04/2004    24
11/05/2004    24
04/04/2005    15
10/03/2004     6
Name: Date, Length: 391, dtype: int64

In [ ]:
df['Time'].value_counts()

08.00.00    390
18.00.00    390
14.00.00    390
10.00.00    390
05.00.00    390
22.00.00    390
12.00.00    390
03.00.00    390
00.00.00    390
23.00.00    390
07.00.00    390
20.00.00    390
06.00.00    390
02.00.00    390
21.00.00    390
01.00.00    390
19.00.00    390
09.00.00    390
13.00.00    390
04.00.00    390
11.00.00    390
16.00.00    389
17.00.00    389
15.00.00    389
Name: Time, dtype: int64

In [ ]:
df['Date'] = df['Date'].fillna('10/03/2004')
df['Time'] = df['Time'].fillna('00.00.00')

In [ ]:
df.isnull().sum()

Date               0
Time               0
CO(GT)           114
PT08.S1(CO)      114
NMHC(GT)         114
C6H6(GT)         114
PT08.S2(NMHC)    114
NOx(GT)          114
PT08.S3(NOx)     114
NO2(GT)          114
PT08.S4(NO2)     114
PT08.S5(O3)      114
T                114
RH               114
AH               114
dtype: int64

In [ ]:
df['CO(GT)'] = df['CO(GT)'].fillna(df['CO(GT)'].mean())
df['PT08.S1(CO)'] = df['PT08.S1(CO)'].fillna(df['PT08.S1(CO)'].mean())
df['NMHC(GT)'] = df['NMHC(GT)'].fillna(df['NMHC(GT)'].mean())
df['C6H6(GT)'] = df['C6H6(GT)'].fillna(df['C6H6(GT)'].mean())
df['PT08.S2(NMHC)'] = df['PT08.S2(NMHC)'].fillna(df['PT08.S2(NMHC)'].mean())
df['NOx(GT)'] = df['NOx(GT)'].fillna(df['NOx(GT)'].mean())
df['PT08.S3(NOx)'] = df['PT08.S3(NOx)'].fillna(df['PT08.S3(NOx)'].mean())
df['NO2(GT)'] = df['NO2(GT)'].fillna(df['NO2(GT)'].mean())
df['PT08.S4(NO2)'] = df['PT08.S4(NO2)'].fillna(df['PT08.S4(NO2)'].mean())
df['PT08.S5(O3)'] = df['PT08.S5(O3)'].fillna(df['PT08.S5(O3)'].mean())
df['T'] = df['T'].fillna(df['T'].mean())
df['RH'] = df['RH'].fillna(df['RH'].mean())
df['AH'] = df['AH'].fillna(df['AH'].mean())

In [ ]:
df.isnull().sum()

Date             0
Time             0
CO(GT)           0
PT08.S1(CO)      0
NMHC(GT)         0
C6H6(GT)         0
PT08.S2(NMHC)    0
NOx(GT)          0
PT08.S3(NOx)     0
NO2(GT)          0
PT08.S4(NO2)     0
PT08.S5(O3)      0
T                0
RH               0
AH               0
dtype: int64

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])

In [ ]:
df['Weekday'] = df['Date'].dt.weekday
df['Month'] = df['Date'].dt.month

In [ ]:
def conv(df):
  for i in df['Time']:
    if i<'08.00.00':
      return 'Morning'
    elif i>='08.00.00' and i < '16.00.00':
      return 'Afternoon'
    else:
      return 'Evening'

In [ ]:
func_check = df.head()

In [ ]:
func_check.apply(conv,axis=1)

0    Afternoon
1    Afternoon
2      Evening
3      Evening
4      Evening
dtype: object

In [ ]:
df['Time of the Day'] = df.apply(conv,axis=1)

In [ ]:
df.head()

        Date      Time  CO(GT)  ...  Weekday  Month  Time of the Day
0 2004-10-03  18.00.00     2.6  ...        6     10        Afternoon
1 2004-10-03  19.00.00     2.0  ...        6     10        Afternoon
2 2004-10-03  20.00.00     2.2  ...        6     10          Evening
3 2004-10-03  21.00.00     2.2  ...        6     10          Evening
4 2004-10-03  22.00.00     1.6  ...        6     10          Evening

[5 rows x 18 columns]

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
LE = LabelEncoder()

In [ ]:
df['Time of the Day'] = LE.fit_transform(df['Time of the Day'])

In [ ]:
df.head()

        Date      Time  CO(GT)  ...  Weekday  Month  Time of the Day
0 2004-10-03  18.00.00     2.6  ...        6     10                0
1 2004-10-03  19.00.00     2.0  ...        6     10                0
2 2004-10-03  20.00.00     2.2  ...        6     10                1
3 2004-10-03  21.00.00     2.2  ...        6     10                1
4 2004-10-03  22.00.00     1.6  ...        6     10                1

[5 rows x 18 columns]